In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [3]:
%%sql
select * from sqlite_master where type='table'

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [8]:
%%sql
-- selecting first five rows in facts table
select * from facts LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Write a single query that returns the:
<ol>
<li>Minimum population
<li>Maximum population
<li>Minimum population growth
<li>Maximum population growth
</ol>

In [9]:
%%sql
select min(population), max(population), min(population_growth), max(population_growth) from facts

Done.

[(0, 7256490011, 0.0, 4.02)]

<ol>
<li>Write a query that returns the countrie(s) with the minimum population.
<li>Write a query that returns the countrie(s) with the maximum population.
</ol>

In [16]:
%%sql
select * from facts where population == (select min(population) from facts)

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [18]:
%%sql
select * from facts where population == (select max(population) from facts)

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

We can identify that according to CIA records, Antarctica has the lowest population. This data is consistent with CIA records of Antarctica (https://www.cia.gov/library/publications/the-world-factbook/geos/ay.html). However, our maximum population value is actually the CIA's estimated global population which is a little over 7.2 billion people.

Calculate the average value for the following columns:

1.population
2.area

In [19]:
%%sql
select avg(population), avg(area) from facts

Done.

[(62094928.32231405, 555093.546184739)]

Write a query that finds all countries meeting both of the following conditions:
1. The population is above average. <br>
2. The area is below average.

In [24]:
%%sql
select name, population, area from facts where population > (select avg(population) from facts) and area < (select avg(area) from facts)

Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

Which countries have the highest ratios of water to land? Which countries have more water than land?

In [25]:
%%sql
select name, MAX(cast(area_water as float)/cast(area_land as float)) as land_water_ratio from facts;

Done.

[('British Indian Ocean Territory', 905.6666666666666)]

In [26]:
%%sql
select name from facts where area_water > area_land

Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

Which countries have a higher death rate than birth rate?

In [28]:
%%sql
select name from facts where death_rate > birth_rate

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]

Which countries will add the most people to their population next year?

In [31]:
%%sql
select name, MAX(population_growth * population) from facts where  name != "World"

Done.

[('India', 1527068612.48)]